# Set3DInfo

## Description
Procedure Set3DInfo sets the height, width and depth dimensions of the referenced object.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE Set3DInfo(
				h              : HANDLE;
				heightDistance : REAL (Coordinate);
				widthDistance  : REAL (Coordinate);
				depthDistance  : REAL (Coordinate));
```

```python

def vs.Set3DInfo(h, heightDistance, widthDistance, depthDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to 3D object.|
|heightDistance|REAL (Coordinate)|New height of object.|
|widthDistance|REAL (Coordinate)|New width of object.|
|depthDistance|REAL (Coordinate)|New depth of object.|

## Version
Availability: from MiniCAD
## Category
* Objects - 3D